{"version":"1.0","truncation":null,"padding":null,"added_tokens":[{"id":0,"special":true,"content":"[PAD]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":1,"special":true,"content":"[UNK]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":2,"special":true,"content":"[CLS]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":3,"special":true,"content":"[SEP]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":4,"special":true,"content":"[MASK]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false}],"normalizer":null,"pre_tokenizer":{"type":"WhitespaceSplit"},"post_processor":{"type":"BertProcessing","sep":["[SEP]",3],"cls":["[CLS]",2]},"decoder":null,"model":{"type":"WordLevel","vocab":{"[PAD]":0,"[UNK]":1,"[CLS]":2,"[SEP]":3,"[MASK]":4,"Grammar_base/Definite#Grammar_base/article":5,"Grammar_base/Indefinite#Grammar_base/article":6,"Grammar_base/Integer_000#entity(Grammar_base/integerT)":7,"Grammar_base/Integer_001#entity(Grammar_base/integerT)":8,"Grammar_base/Integer_002#entity(Grammar_base/integerT)":9,"Grammar_base/Plural#Grammar_base/singplu":10,"Grammar_base/Qualif#Grammar_base/qualif(Grammar_effigy/Type/t)#Grammar_effigy/Type/t#Grammar_base/Qualif/noun":11,"Grammar_base/Qualif/Noun#Grammar_base/Qualif/noun#Grammar_base/article#Grammar_base/singplu":12,"Grammar_effigy/Actor/Entity#Grammar_effigy/Actor/t#entity(Grammar_effigy/actorT)":13,"Grammar_effigy/Actor/Proxy#Grammar_effigy/Actor/t#entity(Grammar_effigy/actorT)":14,"Grammar_effigy/Actor_000#entity(Grammar_effigy/actorT)":15,"Grammar_effigy/Actor_001#entity(Grammar_effigy/actorT)":16,"Grammar_effigy/Actor_002#entity(Grammar_effigy/actorT)":17,"Grammar_effigy/Actor_003#entity(Grammar_effigy/actorT)":18,"Grammar_effigy/Cst_000#entity(Grammar_effigy/cstT)":19,"Grammar_effigy/Cst_001#entity(Grammar_effigy/cstT)":20,"Grammar_effigy/Cst_002#entity(Grammar_effigy/cstT)":21,"Grammar_effigy/Data/Entity#Grammar_effigy/Data/t#entity(Grammar_effigy/data_or_messageT)":22,"Grammar_effigy/Data/Expression#Grammar_effigy/Data/t#Grammar_effigy/Expression/t":23,"Grammar_effigy/Data/Qualif#Grammar_effigy/Data/q(Grammar_effigy/Data/t)#list(Grammar_effigy/Data/t)#option(Grammar_effigy/Data/datamessage_qualif)":24,"Grammar_effigy/Data/Received#Grammar_effigy/Data/datamessage_qualif#option(Grammar_effigy/random_qualif(Grammar_effigy/Message/t))":25,"Grammar_effigy/Data/Response#Grammar_effigy/Data/t":26,"Grammar_effigy/Data/Value#Grammar_effigy/Data/t":27,"Grammar_effigy/Data_000#entity(Grammar_effigy/data_or_messageT)":28,"Grammar_effigy/Data_001#entity(Grammar_effigy/data_or_messageT)":29,"Grammar_effigy/Data_002#entity(Grammar_effigy/data_or_messageT)":30,"Grammar_effigy/Data_003#entity(Grammar_effigy/data_or_messageT)":31,"Grammar_effigy/Data_004#entity(Grammar_effigy/data_or_messageT)":32,"Grammar_effigy/Data_005#entity(Grammar_effigy/data_or_messageT)":33,"Grammar_effigy/Data_006#entity(Grammar_effigy/data_or_messageT)":34,"Grammar_effigy/Data_007#entity(Grammar_effigy/data_or_messageT)":35,"Grammar_effigy/Expression/And#Grammar_effigy/Expression/boolEx#list(Grammar_effigy/Expression/boolExP)":36,"Grammar_effigy/Expression/Apply#Grammar_effigy/Expression/gen#Grammar_effigy/Expression/fun_id#Grammar_effigy/Expression/t":37,"Grammar_effigy/Expression/Arith#Grammar_effigy/Expression/t#Grammar_effigy/Expression/arithEx":38,"Grammar_effigy/Expression/Binary#Grammar_effigy/Expression/encoding":39,"Grammar_effigy/Expression/Bits#Grammar_effigy/Expression/t#Grammar_effigy/Expression/bitsEx":40,"Grammar_effigy/Expression/Concat#Grammar_effigy/Expression/bitsEx#list(Grammar_effigy/Expression/gen)":41,"Grammar_effigy/Expression/Cst#Grammar_effigy/Expression/fun_id#entity(Grammar_effigy/cstT)":42,"Grammar_effigy/Expression/Cst#Grammar_effigy/Expression/gen#entity(Grammar_effigy/cstT)":43,"Grammar_effigy/Expression/Encode#Grammar_effigy/Expression/gen#option(list(Grammar_effigy/Expression/t))#option(Grammar_effigy/Type/t)#option(Grammar_effigy/Expression/encoding)":44,"Grammar_effigy/Expression/Epsilon#Grammar_effigy/Expression/gen#Grammar_base/qualif(Grammar_effigy/Type/t)#option(Grammar_effigy/Expression/boolExP)":45,"Grammar_effigy/Expression/Equal#Grammar_effigy/Expression/boolEx#Grammar_effigy/Expression/t#Grammar_effigy/Expression/t":46,"Grammar_effigy/Expression/GArith#Grammar_effigy/Expression/arithExP#Grammar_effigy/Expression/gen":47,"Grammar_effigy/Expression/GBits#Grammar_effigy/Expression/bitsExP#Grammar_effigy/Expression/gen":48,"Grammar_effigy/Expression/GBool#Grammar_effigy/Expression/boolExP#Grammar_effigy/Expression/gen":49,"Grammar_effigy/Expression/Gen#Grammar_effigy/Expression/t#Grammar_effigy/Expression/gen":50,"Grammar_effigy/Expression/Hash#Grammar_effigy/Expression/arithEx#Grammar_effigy/Expression/bitsExP#option(entity(Grammar_effigy/hashT))":51,"Grammar_effigy/Expression/LSB#Grammar_effigy/Expression/bitsEx#Grammar_effigy/Expression/arithExP":52,"Grammar_effigy/Expression/Length#Grammar_effigy/Expression/arithEx#Grammar_effigy/Length/t":53,"Grammar_effigy/Expression/LengthOf#Grammar_effigy/Expression/arithEx#option(Grammar_effigy/Expression/bitsExP)":54,"Grammar_effigy/Expression/LessThan#Grammar_effigy/Expression/boolEx#Grammar_effigy/Expression/arithExP#Grammar_effigy/Expression/arithExP":55,"Grammar_effigy/Expression/LessThanEq#Grammar_effigy/Expression/boolEx#Grammar_effigy/Expression/arithExP#Grammar_effigy/Expression/arithExP":56,"Grammar_effigy/Expression/Not#Grammar_effigy/Expression/boolEx#Grammar_effigy/Expression/boolExP":57,"Grammar_effigy/Expression/Number#Grammar_effigy/Expression/arithEx#entity(Grammar_effigy/numberT)":58,"Grammar_effigy/Expression/Or#Grammar_effigy/Expression/boolEx#list(Grammar_effigy/Expression/boolExP)":59,"Grammar_effigy/Expression/Output#Grammar_effigy/Expression/gen#option(Grammar_effigy/Expression/fun_id)":60,"Grammar_effigy/Expression/Parameter#Grammar_effigy/Expression/gen#Grammar_effigy/random_qualif(option(entity(Grammar_effigy/varT)))#option(Grammar_effigy/Expression/fun_id)":61,"Grammar_effigy/Expression/Plus#Grammar_effigy/Expression/arithEx#list(Grammar_effigy/Expression/arithExP)":62,"Grammar_effigy/Expression/TArith#Grammar_effigy/Expression/arithExP#Grammar_effigy/Expression/arithEx":63,"Grammar_effigy/Expression/TBits#Grammar_effigy/Expression/bitsExP#Grammar_effigy/Expression/bitsEx":64,"Grammar_effigy/Expression/TBool#Grammar_effigy/Expression/boolExP#Grammar_effigy/Expression/boolEx":65,"Grammar_effigy/Expression/Times#Grammar_effigy/Expression/arithEx#list(Grammar_effigy/Expression/arithExP)":66,"Grammar_effigy/Expression/Var#Grammar_effigy/Expression/fun_id#entity(Grammar_effigy/varT)#option(entity(Grammar_effigy/locT))":67,"Grammar_effigy/Expression/Var#Grammar_effigy/Expression/gen#entity(Grammar_effigy/varT)#option(entity(Grammar_effigy/locT))":68,"Grammar_effigy/Hash_000#entity(Grammar_effigy/hashT)":69,"Grammar_effigy/Length/Length#Grammar_effigy/Length/t#entity(Grammar_base/integerT)#Grammar_effigy/Unit/t":70,"Grammar_effigy/Loc_000#entity(Grammar_effigy/locT)":71,"Grammar_effigy/Loc_001#entity(Grammar_effigy/locT)":72,"Grammar_effigy/Location/AsFollows#Grammar_effigy/Location/t":73,"Grammar_effigy/Location/Loc#Grammar_effigy/Location/t#entity(Grammar_effigy/locT)":74,"Grammar_effigy/Message/Entity#Grammar_effigy/Message/t#entity(Grammar_effigy/data_or_messageT)":75,"Grammar_effigy/Message/Request#Grammar_effigy/Message/t#entity(Grammar_effigy/data_or_messageT)":76,"Grammar_effigy/Message_000#entity(Grammar_effigy/data_or_messageT)":77,"Grammar_effigy/Message_001#entity(Grammar_effigy/data_or_messageT)":78,"Grammar_effigy/Number_000#entity(Grammar_effigy/numberT)":79,"Grammar_effigy/Procedure_000#entity(Grammar_effigy/procedureT)":80,"Grammar_effigy/Protocol/Acceptable#Grammar_effigy/Protocol/condition#Grammar_effigy/Data/q(Grammar_effigy/Data/t)":81,"Grammar_effigy/Protocol/ActAs#Grammar_effigy/Protocol/compute_step#Grammar_effigy/Actor/t":82,"Grammar_effigy/Protocol/Authentication#Grammar_effigy/Protocol/event":83,"Grammar_effigy/Protocol/Authentication#Grammar_effigy/Protocol/procedure":84,"Grammar_effigy/Protocol/Check#Grammar_effigy/Protocol/compute_step#Grammar_effigy/Protocol/condition":85,"Grammar_effigy/Protocol/ComputeStep#Grammar_effigy/Protocol/how#bool#Grammar_effigy/Protocol/compute_step":86,"Grammar_effigy/Protocol/DataComparison#Grammar_effigy/Protocol/condition#Grammar_effigy/Protocol/comparison#Grammar_effigy/Data/q(Grammar_effigy/Data/t)#Grammar_effigy/Data/q(Grammar_effigy/Data/t)":87,"Grammar_effigy/Protocol/Else#Grammar_effigy/Protocol/intro_phrase":88,"Grammar_effigy/Protocol/Entity#Grammar_effigy/Protocol/procedure#entity(Grammar_effigy/procedureT)":89,"Grammar_effigy/Protocol/Equal#Grammar_effigy/Protocol/comparison":90,"Grammar_effigy/Protocol/Expired#Grammar_effigy/Protocol/event#Grammar_effigy/Data/q(Grammar_effigy/Data/t)":91,"Grammar_effigy/Protocol/ExtendedStep#Grammar_effigy/Protocol/compute_step_extended#option(Grammar_effigy/Actor/t)#Grammar_effigy/Protocol/compute_step#Grammar_effigy/Protocol/mode#bool#option(Grammar_effigy/Protocol/how)#option(entity(Grammar_effigy/locT))":92,"Grammar_effigy/Protocol/Fail#Grammar_effigy/Protocol/condition#Grammar_effigy/Protocol/procedure":93,"Grammar_effigy/Protocol/Finally#Grammar_effigy/Protocol/intro_phrase":94,"Grammar_effigy/Protocol/Freshness#Grammar_effigy/Protocol/condition#Grammar_effigy/Data/q(Grammar_effigy/Data/t)":95,"Grammar_effigy/Protocol/Get#Grammar_effigy/Protocol/compute_step#Grammar_effigy/Data/q(Grammar_effigy/Data/t)#option(Grammar_effigy/random_qualif(Grammar_effigy/Actor/t))":96,"Grammar_effigy/Protocol/GoTo#Grammar_effigy/Protocol/compute_step#entity(Grammar_effigy/locT)":97,"Grammar_effigy/Protocol/However#Grammar_effigy/Protocol/intro_phrase":98,"Grammar_effigy/Protocol/ITE#Grammar_effigy/Protocol/compute_step_in_ctxt#Grammar_effigy/Protocol/condition#Grammar_effigy/Protocol/compute_step_extended#option(Grammar_effigy/Protocol/compute_step_extended)":99,"Grammar_effigy/Protocol/IfSo#Grammar_effigy/Protocol/intro_phrase":100,"Grammar_effigy/Protocol/Includes#Grammar_effigy/Protocol/comparison":101,"Grammar_effigy/Protocol/IntroPhrase#Grammar_effigy/Protocol/compute_step_in_ctxt#option(Grammar_effigy/Protocol/intro_phrase)#Grammar_effigy/Protocol/compute_step_extended":102,"Grammar_effigy/Protocol/Present#Grammar_effigy/Protocol/mode":103,"Grammar_effigy/Protocol/Proceed#Grammar_effigy/Protocol/compute_step":104,"Grammar_effigy/Protocol/Produce#Grammar_effigy/Protocol/compute_step#Grammar_effigy/Data/q(Grammar_effigy/Data/t)#option(Grammar_effigy/Data/q(Grammar_effigy/Data/t))":105,"Grammar_effigy/Protocol/Receive#Grammar_effigy/Protocol/condition#Grammar_effigy/Actor/t#Grammar_effigy/Message/t":106,"Grammar_effigy/Protocol/Reception#Grammar_effigy/Protocol/event#Grammar_effigy/Data/q(Grammar_effigy/Data/t)":107,"Grammar_effigy/Protocol/Restoration#Grammar_effigy/Protocol/procedure":108,"Grammar_effigy/Protocol/Send#Grammar_effigy/Protocol/compute_step#Grammar_effigy/random_qualif(Grammar_effigy/Actor/t)#Grammar_effigy/Data/q(Grammar_effigy/Data/t)#option(Grammar_effigy/random_qualif(Grammar_effigy/Message/t))#bool":109,"Grammar_effigy/Protocol/Set#Grammar_effigy/Protocol/compute_step#Grammar_effigy/Data/q(Grammar_effigy/Data/t)#option(Grammar_effigy/Data/q(Grammar_effigy/Data/t))":110,"Grammar_effigy/Protocol/Shall#Grammar_effigy/Protocol/mode":111,"Grammar_effigy/Protocol/Success#Grammar_effigy/Protocol/condition#Grammar_effigy/Protocol/procedure":112,"Grammar_effigy/Protocol/Then#Grammar_effigy/Protocol/intro_phrase":113,"Grammar_effigy/Protocol/Using#Grammar_effigy/Protocol/how#Grammar_effigy/Data/t":114,"Grammar_effigy/Protocol/When#Grammar_effigy/Protocol/compute_step_in_ctxt#Grammar_effigy/Protocol/event#Grammar_effigy/Protocol/compute_step_extended":115,"Grammar_effigy/RandomQualif#Grammar_effigy/random_qualif(Grammar_effigy/Actor/t)#Grammar_effigy/Actor/t":116,"Grammar_effigy/RandomQualif#Grammar_effigy/random_qualif(Grammar_effigy/Message/t)#Grammar_effigy/Message/t":117,"Grammar_effigy/RandomQualif#Grammar_effigy/random_qualif(option(entity(Grammar_effigy/varT)))#option(entity(Grammar_effigy/varT))":118,"Grammar_effigy/Top/Assign#Grammar_effigy/Top/t#option(entity(Grammar_effigy/varT))#Grammar_effigy/Expression/t#option(Grammar_effigy/Location/t)#option(entity(Grammar_effigy/varT))":119,"Grammar_effigy/Top/HasType#Grammar_effigy/Top/t#Grammar_effigy/Expression/t#Grammar_effigy/Type/t":120,"Grammar_effigy/Top/Holds#Grammar_effigy/Top/t#Grammar_effigy/Expression/boolEx":121,"Grammar_effigy/Top/MessageContains#Grammar_effigy/Top/t#option(Grammar_effigy/Message/t)#Grammar_effigy/Data/q(Grammar_effigy/Data/t)":122,"Grammar_effigy/Top/See#Grammar_effigy/Top/t#entity(Grammar_effigy/locT)":123,"Grammar_effigy/Top/Step#Grammar_effigy/Top/t#Grammar_effigy/Protocol/compute_step_in_ctxt":124,"Grammar_effigy/Type/Array#Grammar_effigy/Type/t#option(entity(Grammar_base/integerT))":125,"Grammar_effigy/Type/Bool#Grammar_effigy/Type/t":126,"Grammar_effigy/Type/CharString#Grammar_effigy/Type/t#option(entity(Grammar_base/integerT))":127,"Grammar_effigy/Type/Int#Grammar_effigy/Type/t":128,"Grammar_effigy/Type/String#Grammar_effigy/Type/t#option(Grammar_effigy/Length/t)":129,"Grammar_effigy/Unit/Bit#Grammar_effigy/Unit/t":130,"Grammar_effigy/Unit/Byte#Grammar_effigy/Unit/t":131,"Grammar_effigy/Var_000#entity(Grammar_effigy/varT)":132,"Grammar_effigy/Var_001#entity(Grammar_effigy/varT)":133,"Grammar_effigy/Var_002#entity(Grammar_effigy/varT)":134,"Grammar_effigy/Var_003#entity(Grammar_effigy/varT)":135,"List#list(Grammar_effigy/Data/t)#Grammar_effigy/Data/t":136,"List#list(Grammar_effigy/Data/t)#Grammar_effigy/Data/t#Grammar_effigy/Data/t":137,"List#list(Grammar_effigy/Data/t)#Grammar_effigy/Data/t#Grammar_effigy/Data/t#Grammar_effigy/Data/t":138,"List#list(Grammar_effigy/Data/t)#Grammar_effigy/Data/t#Grammar_effigy/Data/t#Grammar_effigy/Data/t#Grammar_effigy/Data/t":139,"List#list(Grammar_effigy/Expression/arithExP)#Grammar_effigy/Expression/arithExP#Grammar_effigy/Expression/arithExP":140,"List#list(Grammar_effigy/Expression/arithExP)#Grammar_effigy/Expression/arithExP#Grammar_effigy/Expression/arithExP#Grammar_effigy/Expression/arithExP":141,"List#list(Grammar_effigy/Expression/arithExP)#Grammar_effigy/Expression/arithExP#Grammar_effigy/Expression/arithExP#Grammar_effigy/Expression/arithExP#Grammar_effigy/Expression/arithExP":142,"List#list(Grammar_effigy/Expression/arithExP)#Grammar_effigy/Expression/arithExP#Grammar_effigy/Expression/arithExP#Grammar_effigy/Expression/arithExP#Grammar_effigy/Expression/arithExP#Grammar_effigy/Expression/arithExP":143,"List#list(Grammar_effigy/Expression/boolExP)#Grammar_effigy/Expression/boolExP#Grammar_effigy/Expression/boolExP":144,"List#list(Grammar_effigy/Expression/boolExP)#Grammar_effigy/Expression/boolExP#Grammar_effigy/Expression/boolExP#Grammar_effigy/Expression/boolExP":145,"List#list(Grammar_effigy/Expression/boolExP)#Grammar_effigy/Expression/boolExP#Grammar_effigy/Expression/boolExP#Grammar_effigy/Expression/boolExP#Grammar_effigy/Expression/boolExP":146,"List#list(Grammar_effigy/Expression/gen)#Grammar_effigy/Expression/gen#Grammar_effigy/Expression/gen":147,"List#list(Grammar_effigy/Expression/gen)#Grammar_effigy/Expression/gen#Grammar_effigy/Expression/gen#Grammar_effigy/Expression/gen":148,"List#list(Grammar_effigy/Expression/gen)#Grammar_effigy/Expression/gen#Grammar_effigy/Expression/gen#Grammar_effigy/Expression/gen#Grammar_effigy/Expression/gen":149,"List#list(Grammar_effigy/Expression/t)#Grammar_effigy/Expression/t#Grammar_effigy/Expression/t":150,"List#list(Grammar_effigy/Expression/t)#Grammar_effigy/Expression/t#Grammar_effigy/Expression/t#Grammar_effigy/Expression/t":151,"None#option(Grammar_effigy/Data/datamessage_qualif)":152,"None#option(Grammar_effigy/Data/q(Grammar_effigy/Data/t))":153,"None#option(Grammar_effigy/Expression/bitsExP)":154,"None#option(Grammar_effigy/Expression/boolExP)":155,"None#option(Grammar_effigy/Expression/encoding)":156,"None#option(Grammar_effigy/Expression/fun_id)":157,"None#option(Grammar_effigy/Length/t)":158,"None#option(Grammar_effigy/Location/t)":159,"None#option(Grammar_effigy/Message/t)":160,"None#option(Grammar_effigy/Protocol/compute_step_extended)":161,"None#option(Grammar_effigy/Protocol/how)":162,"None#option(Grammar_effigy/Protocol/intro_phrase)":163,"None#option(Grammar_effigy/Type/t)":164,"None#option(Grammar_effigy/random_qualif(Grammar_effigy/Actor/t))":165,"None#option(Grammar_effigy/random_qualif(Grammar_effigy/Message/t))":166,"None#option(entity(Grammar_base/integerT))":167,"None#option(entity(Grammar_effigy/hashT))":168,"None#option(entity(Grammar_effigy/locT))":169,"None#option(entity(Grammar_effigy/varT))":170,"Some#option(Grammar_effigy/Actor/t)#Grammar_effigy/Actor/t":171,"Some#option(Grammar_effigy/Data/datamessage_qualif)#Grammar_effigy/Data/datamessage_qualif":172,"Some#option(Grammar_effigy/Data/q(Grammar_effigy/Data/t))#Grammar_effigy/Data/q(Grammar_effigy/Data/t)":173,"Some#option(Grammar_effigy/Expression/bitsExP)#Grammar_effigy/Expression/bitsExP":174,"Some#option(Grammar_effigy/Expression/boolExP)#Grammar_effigy/Expression/boolExP":175,"Some#option(Grammar_effigy/Expression/encoding)#Grammar_effigy/Expression/encoding":176,"Some#option(Grammar_effigy/Expression/fun_id)#Grammar_effigy/Expression/fun_id":177,"Some#option(Grammar_effigy/Length/t)#Grammar_effigy/Length/t":178,"Some#option(Grammar_effigy/Location/t)#Grammar_effigy/Location/t":179,"Some#option(Grammar_effigy/Message/t)#Grammar_effigy/Message/t":180,"Some#option(Grammar_effigy/Protocol/compute_step_extended)#Grammar_effigy/Protocol/compute_step_extended":181,"Some#option(Grammar_effigy/Protocol/how)#Grammar_effigy/Protocol/how":182,"Some#option(Grammar_effigy/Protocol/intro_phrase)#Grammar_effigy/Protocol/intro_phrase":183,"Some#option(Grammar_effigy/Type/t)#Grammar_effigy/Type/t":184,"Some#option(Grammar_effigy/random_qualif(Grammar_effigy/Actor/t))#Grammar_effigy/random_qualif(Grammar_effigy/Actor/t)":185,"Some#option(Grammar_effigy/random_qualif(Grammar_effigy/Message/t))#Grammar_effigy/random_qualif(Grammar_effigy/Message/t)":186,"Some#option(entity(Grammar_base/integerT))#entity(Grammar_base/integerT)":187,"Some#option(entity(Grammar_effigy/hashT))#entity(Grammar_effigy/hashT)":188,"Some#option(entity(Grammar_effigy/locT))#entity(Grammar_effigy/locT)":189,"Some#option(entity(Grammar_effigy/varT))#entity(Grammar_effigy/varT)":190,"Some#option(list(Grammar_effigy/Expression/t))#list(Grammar_effigy/Expression/t)":191,"false#bool":192,"true#bool":193},"unk_token":"[UNK]"}}