{"_Grammar_effigy/Var_008": 30639, "_Grammar_effigy/Data_011,": 30588, "_Grammar_effigy/Data_012,": 30590, "_Grammar_effigy/Var_004": 30632, "_Grammar_base/Integer_001": 30524, "_Grammar_effigy/Message_003,": 30622, "_Grammar_effigy/Var_000": 30624, "_Grammar_effigy/Loc_000,": 30605, "_Grammar_effigy/Cst_007": 30564, "_Grammar_effigy/Data_009,": 30584, "_Grammar_effigy/Data_001,": 30568, "_Grammar_base/Integer_007,": 30537, "_Grammar_effigy/Cst_000": 30550, "_Grammar_effigy/Data_005": 30575, "_Grammar_effigy/Message_003": 30621, "_Grammar_base/Integer_004": 30530, "_Grammar_effigy/Data_010": 30585, "_Grammar_base/Integer_009": 30540, "_Grammar_effigy/Var_001": 30626, "_Grammar_effigy/Var_005": 30634, "_Grammar_effigy/Var_000,": 30625, "_Grammar_effigy/Cst_006": 30562, "_Grammar_effigy/Cst_005,": 30561, "_Grammar_base/Integer_003,": 30529, "_Grammar_effigy/Cst_003,": 30557, "_Grammar_effigy/Cst_001,": 30553, "_Grammar_effigy/Data_008,": 30582, "_Grammar_effigy/Actor_002,": 30547, "_Grammar_effigy/Message_002": 30619, "_Grammar_effigy/Data_010,": 30586, "_Grammar_base/Integer_000,": 30523, "_Grammar_effigy/Loc_003": 30610, "_Grammar_effigy/Data_015,": 30596, "_Grammar_base/Integer_004,": 30531, "_Grammar_effigy/Loc_003,": 30611, "_Grammar_effigy/Data_019": 30600, "_Grammar_effigy/Var_003": 30630, "_Grammar_base/Integer_002,": 30527, "_Grammar_effigy/Cst_005": 30560, "_Grammar_effigy/Cst_001": 30552, "_Grammar_effigy/Data_006": 30577, "_Grammar_effigy/Data_003,": 30572, "_Grammar_effigy/Hash_000": 30601, "_Grammar_base/Integer_002": 30526, "_Grammar_effigy/Cst_000,": 30551, "_Grammar_effigy/Data_002": 30569, "_Grammar_effigy/Cst_006,": 30563, "_Grammar_effigy/Data_004": 30573, "_Grammar_effigy/Cst_004,": 30559, "_Grammar_base/Integer_005,": 30533, "_Grammar_effigy/Data_013,": 30592, "_Grammar_effigy/Loc_002,": 30609, "_Grammar_effigy/Data_000,": 30566, "_Grammar_effigy/Data_012": 30589, "_Grammar_effigy/Var_004,": 30633, "_Grammar_effigy/Actor_003": 30548, "_Grammar_effigy/Data_017,": 30598, "_Grammar_effigy/Data_011": 30587, "_Grammar_effigy/Data_015": 30595, "_Grammar_effigy/Data_009": 30583, "_Grammar_effigy/Loc_004,": 30613, "_Grammar_effigy/Cst_004": 30558, "_Grammar_effigy/Loc_001,": 30607, "_Grammar_effigy/Message_000,": 30616, "_Grammar_base/Integer_000": 30522, "_Grammar_effigy/Hash_002": 30603, "_Grammar_base/Integer_007": 30536, "_Grammar_effigy/Message_000": 30615, "_Grammar_effigy/Data_000": 30565, "_Grammar_effigy/Message_001": 30617, "_Grammar_effigy/Data_008": 30581, "_Grammar_base/Integer_003": 30528, "_Grammar_effigy/Message_002,": 30620, "_Grammar_effigy/Data_013": 30591, "_Grammar_effigy/Var_006,": 30637, "_Grammar_base/Integer_006,": 30535, "_Grammar_effigy/Loc_001": 30606, "_Grammar_effigy/Data_002,": 30570, "_Grammar_effigy/Var_005,": 30635, "_Grammar_effigy/Var_002": 30628, "_Grammar_base/Integer_001,": 30525, "_Grammar_effigy/Cst_002": 30554, "_Grammar_base/Integer_008": 30538, "_Grammar_effigy/Actor_001,": 30545, "_Grammar_effigy/Loc_002": 30608, "_Grammar_effigy/Data_018": 30599, "_Grammar_effigy/Actor_002": 30546, "_Grammar_effigy/Actor_000": 30542, "_Grammar_effigy/Data_007,": 30580, "_Grammar_base/Integer_005": 30532, "_Grammar_effigy/Data_004,": 30574, "_Grammar_effigy/Var_007": 30638, "_Grammar_effigy/Data_001": 30567, "_Grammar_effigy/Data_007": 30579, "_Grammar_effigy/Var_006": 30636, "_Grammar_base/Integer_006": 30534, "_Grammar_effigy/Loc_000": 30604, "_Grammar_effigy/Cst_002,": 30555, "_Grammar_effigy/Data_006,": 30578, "_Grammar_effigy/Var_009": 30640, "_Grammar_effigy/Loc_005": 30614, "_Grammar_effigy/Actor_004": 30549, "_Grammar_effigy/Var_002,": 30629, "_Grammar_effigy/Loc_004": 30612, "_Grammar_effigy/Var_001,": 30627, "_Grammar_effigy/Actor_000,": 30543, "_Grammar_base/Integer_008,": 30539, "_Grammar_effigy/Procedure_000": 30623, "_Grammar_effigy/Actor_001": 30544, "_Grammar_effigy/Data_005,": 30576, "_Grammar_effigy/Hash_001": 30602, "_Grammar_base/Integer_010": 30541, "_Grammar_effigy/Var_003,": 30631, "_Grammar_effigy/Message_001,": 30618, "_Grammar_effigy/Cst_003": 30556, "_Grammar_effigy/Data_014": 30593, "_Grammar_effigy/Data_003": 30571, "_Grammar_effigy/Data_014,": 30594, "_Grammar_effigy/Data_016": 30597}