{"unk_token": "[UNK]", "sep_token": "[SEP]", "pad_token": "[PAD]", "cls_token": "[CLS]", "mask_token": "[MASK]", "additional_special_tokens": ["_Grammar_base/Integer_000", "_Grammar_base/Integer_000,", "_Grammar_base/Integer_001", "_Grammar_base/Integer_001,", "_Grammar_base/Integer_002", "_Grammar_base/Integer_002,", "_Grammar_base/Integer_003", "_Grammar_base/Integer_003,", "_Grammar_base/Integer_004", "_Grammar_base/Integer_004,", "_Grammar_base/Integer_005", "_Grammar_base/Integer_005,", "_Grammar_base/Integer_006", "_Grammar_base/Integer_006,", "_Grammar_base/Integer_007", "_Grammar_base/Integer_007,", "_Grammar_base/Integer_008", "_Grammar_base/Integer_008,", "_Grammar_base/Integer_009", "_Grammar_base/Integer_010", "_Grammar_effigy/Actor_000", "_Grammar_effigy/Actor_000,", "_Grammar_effigy/Actor_001", "_Grammar_effigy/Actor_001,", "_Grammar_effigy/Actor_002", "_Grammar_effigy/Actor_002,", "_Grammar_effigy/Actor_003", "_Grammar_effigy/Actor_004", "_Grammar_effigy/Cst_000", "_Grammar_effigy/Cst_000,", "_Grammar_effigy/Cst_001", "_Grammar_effigy/Cst_001,", "_Grammar_effigy/Cst_002", "_Grammar_effigy/Cst_002,", "_Grammar_effigy/Cst_003", "_Grammar_effigy/Cst_003,", "_Grammar_effigy/Cst_004", "_Grammar_effigy/Cst_004,", "_Grammar_effigy/Cst_005", "_Grammar_effigy/Cst_005,", "_Grammar_effigy/Cst_006", "_Grammar_effigy/Cst_006,", "_Grammar_effigy/Cst_007", "_Grammar_effigy/Data_000", "_Grammar_effigy/Data_000,", "_Grammar_effigy/Data_001", "_Grammar_effigy/Data_001,", "_Grammar_effigy/Data_002", "_Grammar_effigy/Data_002,", "_Grammar_effigy/Data_003", "_Grammar_effigy/Data_003,", "_Grammar_effigy/Data_004", "_Grammar_effigy/Data_004,", "_Grammar_effigy/Data_005", "_Grammar_effigy/Data_005,", "_Grammar_effigy/Data_006", "_Grammar_effigy/Data_006,", "_Grammar_effigy/Data_007", "_Grammar_effigy/Data_007,", "_Grammar_effigy/Data_008", "_Grammar_effigy/Data_008,", "_Grammar_effigy/Data_009", "_Grammar_effigy/Data_009,", "_Grammar_effigy/Data_010", "_Grammar_effigy/Data_010,", "_Grammar_effigy/Data_011", "_Grammar_effigy/Data_011,", "_Grammar_effigy/Data_012", "_Grammar_effigy/Data_012,", "_Grammar_effigy/Data_013", "_Grammar_effigy/Data_013,", "_Grammar_effigy/Data_014", "_Grammar_effigy/Data_014,", "_Grammar_effigy/Data_015", "_Grammar_effigy/Data_015,", "_Grammar_effigy/Data_016", "_Grammar_effigy/Data_017,", "_Grammar_effigy/Data_018", "_Grammar_effigy/Data_019", "_Grammar_effigy/Hash_000", "_Grammar_effigy/Hash_001", "_Grammar_effigy/Hash_002", "_Grammar_effigy/Loc_000", "_Grammar_effigy/Loc_000,", "_Grammar_effigy/Loc_001", "_Grammar_effigy/Loc_001,", "_Grammar_effigy/Loc_002", "_Grammar_effigy/Loc_002,", "_Grammar_effigy/Loc_003", "_Grammar_effigy/Loc_003,", "_Grammar_effigy/Loc_004", "_Grammar_effigy/Loc_004,", "_Grammar_effigy/Loc_005", "_Grammar_effigy/Message_000", "_Grammar_effigy/Message_000,", "_Grammar_effigy/Message_001", "_Grammar_effigy/Message_001,", "_Grammar_effigy/Message_002", "_Grammar_effigy/Message_002,", "_Grammar_effigy/Message_003", "_Grammar_effigy/Message_003,", "_Grammar_effigy/Procedure_000", "_Grammar_effigy/Var_000", "_Grammar_effigy/Var_000,", "_Grammar_effigy/Var_001", "_Grammar_effigy/Var_001,", "_Grammar_effigy/Var_002", "_Grammar_effigy/Var_002,", "_Grammar_effigy/Var_003", "_Grammar_effigy/Var_003,", "_Grammar_effigy/Var_004", "_Grammar_effigy/Var_004,", "_Grammar_effigy/Var_005", "_Grammar_effigy/Var_005,", "_Grammar_effigy/Var_006", "_Grammar_effigy/Var_006,", "_Grammar_effigy/Var_007", "_Grammar_effigy/Var_008", "_Grammar_effigy/Var_009"]}