{"version":"1.0","truncation":null,"padding":null,"added_tokens":[{"id":0,"special":true,"content":"[PAD]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":1,"special":true,"content":"[UNK]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":2,"special":true,"content":"[CLS]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":3,"special":true,"content":"[SEP]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":4,"special":true,"content":"[MASK]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false}],"normalizer":null,"pre_tokenizer":{"type":"WhitespaceSplit"},"post_processor":{"type":"BertProcessing","sep":["[SEP]",3],"cls":["[CLS]",2]},"decoder":null,"model":{"type":"WordLevel","vocab":{"[PAD]":0,"[UNK]":1,"[CLS]":2,"[SEP]":3,"[MASK]":4,"Geometry_grammar/Acute#Geometry_grammar/pred#Geometry_grammar/angle":5,"Geometry_grammar/Alternate_ext#Geometry_grammar/pred#Geometry_grammar/angle#Geometry_grammar/angle":6,"Geometry_grammar/Alternate_int#Geometry_grammar/pred#Geometry_grammar/angle#Geometry_grammar/angle":7,"Geometry_grammar/Altitude#Geometry_grammar/segment#Geometry_grammar/segment#Geometry_grammar/pt":8,"Geometry_grammar/Angle#Geometry_grammar/angle#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt":9,"Geometry_grammar/Angle_string_000#entity(Geometry_grammar/kstring)":10,"Geometry_grammar/Angle_string_001#entity(Geometry_grammar/kstring)":11,"Geometry_grammar/Arccos#Geometry_grammar/number#Geometry_grammar/number":12,"Geometry_grammar/Arcsin#Geometry_grammar/number#Geometry_grammar/number":13,"Geometry_grammar/Arctan#Geometry_grammar/number#Geometry_grammar/number":14,"Geometry_grammar/Area_circle#Geometry_grammar/number#Geometry_grammar/circle":15,"Geometry_grammar/Area_quad#Geometry_grammar/number#Geometry_grammar/quad":16,"Geometry_grammar/Area_tri#Geometry_grammar/number#Geometry_grammar/triangle":17,"Geometry_grammar/Bisector#Geometry_grammar/line#Geometry_grammar/angle":18,"Geometry_grammar/C_angle#Geometry_grammar/constr#Geometry_grammar/angle":19,"Geometry_grammar/C_circle#Geometry_grammar/constr#Geometry_grammar/circle":20,"Geometry_grammar/C_entity#Geometry_grammar/constr#entity(Geometry_grammar/kstring)":21,"Geometry_grammar/C_line#Geometry_grammar/constr#Geometry_grammar/line":22,"Geometry_grammar/C_plane#Geometry_grammar/constr#Geometry_grammar/plane":23,"Geometry_grammar/C_point#Geometry_grammar/constr#Geometry_grammar/pt":24,"Geometry_grammar/C_poly#Geometry_grammar/constr#Geometry_grammar/poly":25,"Geometry_grammar/C_quad#Geometry_grammar/constr#Geometry_grammar/quad":26,"Geometry_grammar/C_ray#Geometry_grammar/constr#Geometry_grammar/ray":27,"Geometry_grammar/C_segment#Geometry_grammar/constr#Geometry_grammar/segment":28,"Geometry_grammar/C_triangle#Geometry_grammar/constr#Geometry_grammar/triangle":29,"Geometry_grammar/Centroid#Geometry_grammar/pt#Geometry_grammar/triangle":30,"Geometry_grammar/Circle_center#Geometry_grammar/pt#Geometry_grammar/circle":31,"Geometry_grammar/Circle_circum#Geometry_grammar/circle#Geometry_grammar/triangle":32,"Geometry_grammar/Circle_diam#Geometry_grammar/circle#Geometry_grammar/segment":33,"Geometry_grammar/Circle_diam_nb#Geometry_grammar/circle#Geometry_grammar/number#Geometry_grammar/pt":34,"Geometry_grammar/Circle_in#Geometry_grammar/circle#Geometry_grammar/triangle":35,"Geometry_grammar/Circle_radius#Geometry_grammar/circle#Geometry_grammar/segment#Geometry_grammar/pt":36,"Geometry_grammar/Circle_radius_nb#Geometry_grammar/circle#Geometry_grammar/number#Geometry_grammar/pt":37,"Geometry_grammar/Circle_string_000#entity(Geometry_grammar/kstring)":38,"Geometry_grammar/Circle_string_001#entity(Geometry_grammar/kstring)":39,"Geometry_grammar/Circle_string_002#entity(Geometry_grammar/kstring)":40,"Geometry_grammar/Circle_string_003#entity(Geometry_grammar/kstring)":41,"Geometry_grammar/Circumcenter#Geometry_grammar/pt#Geometry_grammar/triangle":42,"Geometry_grammar/Colinear#Geometry_grammar/pred#list(Geometry_grammar/pt)":43,"Geometry_grammar/Comp#Geometry_grammar/pred#Geometry_grammar/binop#list(Geometry_grammar/number)":44,"Geometry_grammar/Complementary#Geometry_grammar/pred#Geometry_grammar/angle#Geometry_grammar/angle":45,"Geometry_grammar/Concurrent#Geometry_grammar/pred#Geometry_grammar/line#Geometry_grammar/line#Geometry_grammar/line":46,"Geometry_grammar/Cong_angle#Geometry_grammar/pred#Geometry_grammar/angle#Geometry_grammar/angle":47,"Geometry_grammar/Cong_seg#Geometry_grammar/pred#Geometry_grammar/segment#Geometry_grammar/segment":48,"Geometry_grammar/Const#Geometry_grammar/number#entity(Geometry_grammar/kfloat)":49,"Geometry_grammar/Coplanar_lines#Geometry_grammar/pred#list(Geometry_grammar/line)":50,"Geometry_grammar/Coplanar_points#Geometry_grammar/pred#list(Geometry_grammar/pt)":51,"Geometry_grammar/Correspondant#Geometry_grammar/pred#Geometry_grammar/angle#Geometry_grammar/angle":52,"Geometry_grammar/Cos#Geometry_grammar/number#Geometry_grammar/number":53,"Geometry_grammar/Def_angle#Geometry_grammar/named_object#entity(Geometry_grammar/kstring)":54,"Geometry_grammar/Def_angle_3pts#Geometry_grammar/named_object#entity(Geometry_grammar/kstring)#entity(Geometry_grammar/kstring)#entity(Geometry_grammar/kstring)":55,"Geometry_grammar/Def_circle#Geometry_grammar/named_object#entity(Geometry_grammar/kstring)":56,"Geometry_grammar/Def_line#Geometry_grammar/named_object#entity(Geometry_grammar/kstring)":57,"Geometry_grammar/Def_line_2pts#Geometry_grammar/named_object#entity(Geometry_grammar/kstring)#entity(Geometry_grammar/kstring)":58,"Geometry_grammar/Def_plane#Geometry_grammar/named_object#entity(Geometry_grammar/kstring)":59,"Geometry_grammar/Def_plane_3pts#Geometry_grammar/named_object#entity(Geometry_grammar/kstring)#entity(Geometry_grammar/kstring)#entity(Geometry_grammar/kstring)":60,"Geometry_grammar/Def_point#Geometry_grammar/named_object#entity(Geometry_grammar/kstring)":61,"Geometry_grammar/Def_quad#Geometry_grammar/named_object#entity(Geometry_grammar/kstring)":62,"Geometry_grammar/Def_quad_4pts#Geometry_grammar/named_object#entity(Geometry_grammar/kstring)#entity(Geometry_grammar/kstring)#entity(Geometry_grammar/kstring)#entity(Geometry_grammar/kstring)":63,"Geometry_grammar/Def_ray#Geometry_grammar/named_object#entity(Geometry_grammar/kstring)":64,"Geometry_grammar/Def_ray_2pts#Geometry_grammar/named_object#entity(Geometry_grammar/kstring)#entity(Geometry_grammar/kstring)":65,"Geometry_grammar/Def_segment#Geometry_grammar/named_object#entity(Geometry_grammar/kstring)":66,"Geometry_grammar/Def_segment_2pts#Geometry_grammar/named_object#entity(Geometry_grammar/kstring)#entity(Geometry_grammar/kstring)":67,"Geometry_grammar/Def_triangle#Geometry_grammar/named_object#entity(Geometry_grammar/kstring)":68,"Geometry_grammar/Def_triangle_3pts#Geometry_grammar/named_object#entity(Geometry_grammar/kstring)#entity(Geometry_grammar/kstring)#entity(Geometry_grammar/kstring)":69,"Geometry_grammar/Diagonal#Geometry_grammar/segment#Geometry_grammar/quad#Geometry_grammar/pt#Geometry_grammar/pt":70,"Geometry_grammar/Diff#Geometry_grammar/pred#list(Geometry_grammar/constr)":71,"Geometry_grammar/Div#Geometry_grammar/number#Geometry_grammar/number#Geometry_grammar/number":72,"Geometry_grammar/Eq#Geometry_grammar/binop":73,"Geometry_grammar/Equidistant#Geometry_grammar/pred#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt":74,"Geometry_grammar/Flat#Geometry_grammar/pred#Geometry_grammar/angle":75,"Geometry_grammar/Float_000#entity(Geometry_grammar/kfloat)":76,"Geometry_grammar/Float_001#entity(Geometry_grammar/kfloat)":77,"Geometry_grammar/Float_002#entity(Geometry_grammar/kfloat)":78,"Geometry_grammar/Float_003#entity(Geometry_grammar/kfloat)":79,"Geometry_grammar/Fml#Geometry_grammar/formula#list(Geometry_grammar/named_object)#list(Geometry_grammar/pred)#list(Geometry_grammar/named_object)#list(list(Geometry_grammar/pred))":80,"Geometry_grammar/Four#Geometry_grammar/number":81,"Geometry_grammar/Full#Geometry_grammar/pred#Geometry_grammar/angle":82,"Geometry_grammar/Ge#Geometry_grammar/binop":83,"Geometry_grammar/Gt#Geometry_grammar/binop":84,"Geometry_grammar/Heptagon#Geometry_grammar/poly#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt":85,"Geometry_grammar/Hexagon#Geometry_grammar/poly#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt":86,"Geometry_grammar/Hypotenuse#Geometry_grammar/segment#Geometry_grammar/triangle":87,"Geometry_grammar/In_angle#Geometry_grammar/pred#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt":88,"Geometry_grammar/Incenter#Geometry_grammar/pt#Geometry_grammar/triangle":89,"Geometry_grammar/Incid_circle#Geometry_grammar/pred#Geometry_grammar/pt#Geometry_grammar/circle":90,"Geometry_grammar/Incid_line#Geometry_grammar/pred#Geometry_grammar/pt#Geometry_grammar/line":91,"Geometry_grammar/Incid_seg#Geometry_grammar/pred#Geometry_grammar/pt#Geometry_grammar/segment":92,"Geometry_grammar/Intersecting#Geometry_grammar/pred#Geometry_grammar/line#Geometry_grammar/line#Geometry_grammar/line":93,"Geometry_grammar/Intersection_diags#Geometry_grammar/pt#Geometry_grammar/quad":94,"Geometry_grammar/Intersection_line_line#Geometry_grammar/pt#Geometry_grammar/line#Geometry_grammar/line":95,"Geometry_grammar/Intersection_line_seg#Geometry_grammar/pt#Geometry_grammar/line#Geometry_grammar/segment":96,"Geometry_grammar/Intersection_seg_seg#Geometry_grammar/pt#Geometry_grammar/segment#Geometry_grammar/segment":97,"Geometry_grammar/Is_chord#Geometry_grammar/pred#Geometry_grammar/segment#Geometry_grammar/circle":98,"Geometry_grammar/Is_crossed#Geometry_grammar/pred#Geometry_grammar/quad":99,"Geometry_grammar/Is_diameter#Geometry_grammar/pred#Geometry_grammar/segment#Geometry_grammar/circle":100,"Geometry_grammar/Is_inscribed#Geometry_grammar/pred#Geometry_grammar/triangle#Geometry_grammar/circle":101,"Geometry_grammar/Is_intersecting_in_midpoint#Geometry_grammar/pred#Geometry_grammar/segment#Geometry_grammar/segment":102,"Geometry_grammar/Is_intersecting_line_line#Geometry_grammar/pred#Geometry_grammar/line#Geometry_grammar/line":103,"Geometry_grammar/Is_intersecting_line_line_in#Geometry_grammar/pred#Geometry_grammar/line#Geometry_grammar/line#Geometry_grammar/pt":104,"Geometry_grammar/Is_intersecting_line_plane#Geometry_grammar/pred#Geometry_grammar/line#Geometry_grammar/plane":105,"Geometry_grammar/Is_intersecting_line_plane_in#Geometry_grammar/pred#Geometry_grammar/line#Geometry_grammar/plane#Geometry_grammar/pt":106,"Geometry_grammar/Is_intersecting_line_seg#Geometry_grammar/pred#Geometry_grammar/line#Geometry_grammar/segment":107,"Geometry_grammar/Is_intersecting_line_seg_in#Geometry_grammar/pred#Geometry_grammar/line#Geometry_grammar/segment#Geometry_grammar/pt":108,"Geometry_grammar/Is_intersecting_plane_plane#Geometry_grammar/pred#Geometry_grammar/plane#Geometry_grammar/plane":109,"Geometry_grammar/Is_intersecting_plane_plane_in#Geometry_grammar/pred#Geometry_grammar/plane#Geometry_grammar/plane#Geometry_grammar/line":110,"Geometry_grammar/Is_intersecting_seg_seg#Geometry_grammar/pred#Geometry_grammar/segment#Geometry_grammar/segment":111,"Geometry_grammar/Is_intersecting_seg_seg_in#Geometry_grammar/pred#Geometry_grammar/segment#Geometry_grammar/segment#Geometry_grammar/pt":112,"Geometry_grammar/Is_not_crossed#Geometry_grammar/pred#Geometry_grammar/quad":113,"Geometry_grammar/Is_parallel_line_line#Geometry_grammar/pred#list(Geometry_grammar/line)":114,"Geometry_grammar/Is_parallel_line_plane#Geometry_grammar/pred#Geometry_grammar/line#Geometry_grammar/plane":115,"Geometry_grammar/Is_parallel_plane_plane#Geometry_grammar/pred#list(Geometry_grammar/plane)":116,"Geometry_grammar/Is_perpendicular_line_line#Geometry_grammar/pred#list(Geometry_grammar/line)":117,"Geometry_grammar/Is_perpendicular_line_plane#Geometry_grammar/pred#Geometry_grammar/line#Geometry_grammar/plane":118,"Geometry_grammar/Is_radius#Geometry_grammar/pred#Geometry_grammar/segment#Geometry_grammar/circle":119,"Geometry_grammar/Is_symetric_angle_axis#Geometry_grammar/pred#Geometry_grammar/angle#Geometry_grammar/line#Geometry_grammar/angle":120,"Geometry_grammar/Is_symetric_angle_point#Geometry_grammar/pred#Geometry_grammar/angle#Geometry_grammar/pt#Geometry_grammar/angle":121,"Geometry_grammar/Is_symetric_circle_axis#Geometry_grammar/pred#Geometry_grammar/circle#Geometry_grammar/line#Geometry_grammar/circle":122,"Geometry_grammar/Is_symetric_circle_point#Geometry_grammar/pred#Geometry_grammar/circle#Geometry_grammar/pt#Geometry_grammar/circle":123,"Geometry_grammar/Is_symetric_line_axis#Geometry_grammar/pred#Geometry_grammar/line#Geometry_grammar/line#Geometry_grammar/line":124,"Geometry_grammar/Is_symetric_line_point#Geometry_grammar/pred#Geometry_grammar/line#Geometry_grammar/pt#Geometry_grammar/line":125,"Geometry_grammar/Is_symetric_plane_axis#Geometry_grammar/pred#Geometry_grammar/plane#Geometry_grammar/line#Geometry_grammar/plane":126,"Geometry_grammar/Is_symetric_plane_point#Geometry_grammar/pred#Geometry_grammar/plane#Geometry_grammar/pt#Geometry_grammar/plane":127,"Geometry_grammar/Is_symetric_point_axis#Geometry_grammar/pred#Geometry_grammar/pt#Geometry_grammar/line#Geometry_grammar/pt":128,"Geometry_grammar/Is_symetric_point_point#Geometry_grammar/pred#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt":129,"Geometry_grammar/Is_symetric_poly_axis#Geometry_grammar/pred#Geometry_grammar/poly#Geometry_grammar/line#Geometry_grammar/poly":130,"Geometry_grammar/Is_symetric_quad_axis#Geometry_grammar/pred#Geometry_grammar/quad#Geometry_grammar/line#Geometry_grammar/quad":131,"Geometry_grammar/Is_symetric_quad_point#Geometry_grammar/pred#Geometry_grammar/quad#Geometry_grammar/pt#Geometry_grammar/quad":132,"Geometry_grammar/Is_symetric_ray_axis#Geometry_grammar/pred#Geometry_grammar/ray#Geometry_grammar/line#Geometry_grammar/ray":133,"Geometry_grammar/Is_symetric_ray_point#Geometry_grammar/pred#Geometry_grammar/ray#Geometry_grammar/pt#Geometry_grammar/ray":134,"Geometry_grammar/Is_symetric_seg_axis#Geometry_grammar/pred#Geometry_grammar/segment#Geometry_grammar/line#Geometry_grammar/segment":135,"Geometry_grammar/Is_symetric_seg_point#Geometry_grammar/pred#Geometry_grammar/segment#Geometry_grammar/pt#Geometry_grammar/segment":136,"Geometry_grammar/Is_symetric_tri_axis#Geometry_grammar/pred#Geometry_grammar/triangle#Geometry_grammar/line#Geometry_grammar/triangle":137,"Geometry_grammar/Is_symetric_tri_point#Geometry_grammar/pred#Geometry_grammar/triangle#Geometry_grammar/pt#Geometry_grammar/triangle":138,"Geometry_grammar/Is_tangent#Geometry_grammar/pred#Geometry_grammar/line#Geometry_grammar/circle":139,"Geometry_grammar/Is_tangent_at#Geometry_grammar/pred#Geometry_grammar/line#Geometry_grammar/circle#Geometry_grammar/pt":140,"Geometry_grammar/Is_tangent_circles#Geometry_grammar/pred#Geometry_grammar/circle#Geometry_grammar/circle":141,"Geometry_grammar/Kite#Geometry_grammar/pred#Geometry_grammar/quad":142,"Geometry_grammar/Le#Geometry_grammar/binop":143,"Geometry_grammar/Line#Geometry_grammar/line#Geometry_grammar/pt#Geometry_grammar/pt":144,"Geometry_grammar/Line_from_seg#Geometry_grammar/line#Geometry_grammar/segment":145,"Geometry_grammar/Line_is_in_plane#Geometry_grammar/pred#Geometry_grammar/line#Geometry_grammar/plane":146,"Geometry_grammar/Line_string_000#entity(Geometry_grammar/kstring)":147,"Geometry_grammar/Line_string_001#entity(Geometry_grammar/kstring)":148,"Geometry_grammar/Line_string_002#entity(Geometry_grammar/kstring)":149,"Geometry_grammar/Line_string_003#entity(Geometry_grammar/kstring)":150,"Geometry_grammar/Line_string_004#entity(Geometry_grammar/kstring)":151,"Geometry_grammar/Line_string_005#entity(Geometry_grammar/kstring)":152,"Geometry_grammar/Lt#Geometry_grammar/binop":153,"Geometry_grammar/Measure_angle#Geometry_grammar/number#Geometry_grammar/angle":154,"Geometry_grammar/Measure_pointline#Geometry_grammar/number#Geometry_grammar/pt#Geometry_grammar/line":155,"Geometry_grammar/Measure_radius#Geometry_grammar/number#Geometry_grammar/circle":156,"Geometry_grammar/Measure_seg#Geometry_grammar/number#Geometry_grammar/segment":157,"Geometry_grammar/Median#Geometry_grammar/segment#Geometry_grammar/segment#Geometry_grammar/pt":158,"Geometry_grammar/Midpoint#Geometry_grammar/pt#Geometry_grammar/segment":159,"Geometry_grammar/Minus#Geometry_grammar/number#Geometry_grammar/number#Geometry_grammar/number":160,"Geometry_grammar/Mult#Geometry_grammar/number#Geometry_grammar/number#Geometry_grammar/number":161,"Geometry_grammar/Named_angle#Geometry_grammar/angle#entity(Geometry_grammar/kstring)":162,"Geometry_grammar/Named_circle#Geometry_grammar/circle#entity(Geometry_grammar/kstring)":163,"Geometry_grammar/Named_line#Geometry_grammar/line#entity(Geometry_grammar/kstring)":164,"Geometry_grammar/Named_plane#Geometry_grammar/plane#entity(Geometry_grammar/kstring)":165,"Geometry_grammar/Named_point#Geometry_grammar/pt#entity(Geometry_grammar/kstring)":166,"Geometry_grammar/Named_poly#Geometry_grammar/poly#entity(Geometry_grammar/kstring)":167,"Geometry_grammar/Named_quad#Geometry_grammar/quad#entity(Geometry_grammar/kstring)":168,"Geometry_grammar/Named_ray#Geometry_grammar/ray#entity(Geometry_grammar/kstring)":169,"Geometry_grammar/Named_seg#Geometry_grammar/segment#entity(Geometry_grammar/kstring)":170,"Geometry_grammar/Named_tri#Geometry_grammar/triangle#entity(Geometry_grammar/kstring)":171,"Geometry_grammar/Neq#Geometry_grammar/binop":172,"Geometry_grammar/Not_incid_line#Geometry_grammar/pred#Geometry_grammar/pt#Geometry_grammar/line":173,"Geometry_grammar/Not_intersecting_line_line#Geometry_grammar/pred#Geometry_grammar/line#Geometry_grammar/line":174,"Geometry_grammar/Not_intersecting_line_plane#Geometry_grammar/pred#Geometry_grammar/line#Geometry_grammar/plane":175,"Geometry_grammar/Null#Geometry_grammar/pred#Geometry_grammar/angle":176,"Geometry_grammar/Obtuse#Geometry_grammar/pred#Geometry_grammar/angle":177,"Geometry_grammar/Octagon#Geometry_grammar/poly#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt":178,"Geometry_grammar/One#Geometry_grammar/number":179,"Geometry_grammar/Opp#Geometry_grammar/number#Geometry_grammar/number":180,"Geometry_grammar/Opposed_seg#Geometry_grammar/segment#Geometry_grammar/pt#Geometry_grammar/triangle":181,"Geometry_grammar/Orthocenter#Geometry_grammar/pt#Geometry_grammar/triangle":182,"Geometry_grammar/Parallelogram#Geometry_grammar/pred#Geometry_grammar/quad":183,"Geometry_grammar/Pentagon#Geometry_grammar/poly#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt":184,"Geometry_grammar/Perp_bisector#Geometry_grammar/line#Geometry_grammar/segment":185,"Geometry_grammar/Pi#Geometry_grammar/number":186,"Geometry_grammar/Plane_from_points#Geometry_grammar/plane#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt":187,"Geometry_grammar/Plane_string_000#entity(Geometry_grammar/kstring)":188,"Geometry_grammar/Plane_string_001#entity(Geometry_grammar/kstring)":189,"Geometry_grammar/Plane_string_002#entity(Geometry_grammar/kstring)":190,"Geometry_grammar/Plane_string_003#entity(Geometry_grammar/kstring)":191,"Geometry_grammar/Plus#Geometry_grammar/number#Geometry_grammar/number#Geometry_grammar/number":192,"Geometry_grammar/Point_is_in_plane#Geometry_grammar/pred#Geometry_grammar/pt#Geometry_grammar/plane":193,"Geometry_grammar/Point_string_000#entity(Geometry_grammar/kstring)":194,"Geometry_grammar/Point_string_001#entity(Geometry_grammar/kstring)":195,"Geometry_grammar/Point_string_002#entity(Geometry_grammar/kstring)":196,"Geometry_grammar/Point_string_003#entity(Geometry_grammar/kstring)":197,"Geometry_grammar/Point_string_004#entity(Geometry_grammar/kstring)":198,"Geometry_grammar/Point_string_005#entity(Geometry_grammar/kstring)":199,"Geometry_grammar/Point_string_006#entity(Geometry_grammar/kstring)":200,"Geometry_grammar/Point_string_007#entity(Geometry_grammar/kstring)":201,"Geometry_grammar/Point_string_008#entity(Geometry_grammar/kstring)":202,"Geometry_grammar/Point_string_009#entity(Geometry_grammar/kstring)":203,"Geometry_grammar/Point_string_010#entity(Geometry_grammar/kstring)":204,"Geometry_grammar/Point_string_011#entity(Geometry_grammar/kstring)":205,"Geometry_grammar/Point_string_012#entity(Geometry_grammar/kstring)":206,"Geometry_grammar/Point_string_013#entity(Geometry_grammar/kstring)":207,"Geometry_grammar/Point_string_014#entity(Geometry_grammar/kstring)":208,"Geometry_grammar/Point_string_015#entity(Geometry_grammar/kstring)":209,"Geometry_grammar/Point_string_016#entity(Geometry_grammar/kstring)":210,"Geometry_grammar/Point_string_017#entity(Geometry_grammar/kstring)":211,"Geometry_grammar/Point_string_018#entity(Geometry_grammar/kstring)":212,"Geometry_grammar/Point_string_019#entity(Geometry_grammar/kstring)":213,"Geometry_grammar/Point_string_020#entity(Geometry_grammar/kstring)":214,"Geometry_grammar/Point_string_021#entity(Geometry_grammar/kstring)":215,"Geometry_grammar/Point_string_022#entity(Geometry_grammar/kstring)":216,"Geometry_grammar/Point_string_023#entity(Geometry_grammar/kstring)":217,"Geometry_grammar/Point_string_024#entity(Geometry_grammar/kstring)":218,"Geometry_grammar/Point_string_025#entity(Geometry_grammar/kstring)":219,"Geometry_grammar/Point_string_026#entity(Geometry_grammar/kstring)":220,"Geometry_grammar/Point_string_027#entity(Geometry_grammar/kstring)":221,"Geometry_grammar/Point_string_028#entity(Geometry_grammar/kstring)":222,"Geometry_grammar/Point_string_029#entity(Geometry_grammar/kstring)":223,"Geometry_grammar/Point_string_030#entity(Geometry_grammar/kstring)":224,"Geometry_grammar/Point_string_031#entity(Geometry_grammar/kstring)":225,"Geometry_grammar/Point_string_032#entity(Geometry_grammar/kstring)":226,"Geometry_grammar/Point_string_033#entity(Geometry_grammar/kstring)":227,"Geometry_grammar/Point_string_034#entity(Geometry_grammar/kstring)":228,"Geometry_grammar/Point_string_035#entity(Geometry_grammar/kstring)":229,"Geometry_grammar/Point_string_036#entity(Geometry_grammar/kstring)":230,"Geometry_grammar/Point_string_037#entity(Geometry_grammar/kstring)":231,"Geometry_grammar/Point_string_038#entity(Geometry_grammar/kstring)":232,"Geometry_grammar/Poly_string_000#entity(Geometry_grammar/kstring)":233,"Geometry_grammar/Poly_string_001#entity(Geometry_grammar/kstring)":234,"Geometry_grammar/Pow#Geometry_grammar/number#Geometry_grammar/number#Geometry_grammar/number":235,"Geometry_grammar/Proj_ortho#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/line":236,"Geometry_grammar/Proj_para#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/line#Geometry_grammar/line":237,"Geometry_grammar/Quad#Geometry_grammar/quad#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt":238,"Geometry_grammar/Quad_angle#Geometry_grammar/angle#Geometry_grammar/quad#Geometry_grammar/pt":239,"Geometry_grammar/Quad_string_000#entity(Geometry_grammar/kstring)":240,"Geometry_grammar/Quad_string_001#entity(Geometry_grammar/kstring)":241,"Geometry_grammar/Ray#Geometry_grammar/ray#Geometry_grammar/pt#Geometry_grammar/pt":242,"Geometry_grammar/Ray_string_000#entity(Geometry_grammar/kstring)":243,"Geometry_grammar/Ray_string_001#entity(Geometry_grammar/kstring)":244,"Geometry_grammar/Ray_string_002#entity(Geometry_grammar/kstring)":245,"Geometry_grammar/Rectangle#Geometry_grammar/pred#Geometry_grammar/quad":246,"Geometry_grammar/Regular#Geometry_grammar/pred#Geometry_grammar/poly":247,"Geometry_grammar/Rhombus#Geometry_grammar/pred#Geometry_grammar/quad":248,"Geometry_grammar/Right#Geometry_grammar/pred#Geometry_grammar/angle":249,"Geometry_grammar/Same#Geometry_grammar/pred#list(Geometry_grammar/constr)":250,"Geometry_grammar/Seg_is_in_plane#Geometry_grammar/pred#Geometry_grammar/segment#Geometry_grammar/plane":251,"Geometry_grammar/Segment#Geometry_grammar/segment#Geometry_grammar/pt#Geometry_grammar/pt":252,"Geometry_grammar/Segment_string_000#entity(Geometry_grammar/kstring)":253,"Geometry_grammar/Segment_string_001#entity(Geometry_grammar/kstring)":254,"Geometry_grammar/Segment_string_002#entity(Geometry_grammar/kstring)":255,"Geometry_grammar/Signed_area_quad#Geometry_grammar/number#Geometry_grammar/quad":256,"Geometry_grammar/Signed_area_tri#Geometry_grammar/number#Geometry_grammar/triangle":257,"Geometry_grammar/Signed_measure_seg#Geometry_grammar/number#Geometry_grammar/segment":258,"Geometry_grammar/Sin#Geometry_grammar/number#Geometry_grammar/number":259,"Geometry_grammar/Skew_lines#Geometry_grammar/pred#list(Geometry_grammar/line)":260,"Geometry_grammar/Square#Geometry_grammar/pred#Geometry_grammar/quad":261,"Geometry_grammar/Squared#Geometry_grammar/number#Geometry_grammar/number":262,"Geometry_grammar/Supplementary#Geometry_grammar/pred#Geometry_grammar/angle#Geometry_grammar/angle":263,"Geometry_grammar/Symmetric_angle_axis#Geometry_grammar/angle#Geometry_grammar/angle#Geometry_grammar/line":264,"Geometry_grammar/Symmetric_angle_point#Geometry_grammar/angle#Geometry_grammar/angle#Geometry_grammar/pt":265,"Geometry_grammar/Symmetric_circle_axis#Geometry_grammar/circle#Geometry_grammar/circle#Geometry_grammar/line":266,"Geometry_grammar/Symmetric_circle_point#Geometry_grammar/circle#Geometry_grammar/circle#Geometry_grammar/pt":267,"Geometry_grammar/Symmetric_line_axis#Geometry_grammar/line#Geometry_grammar/line#Geometry_grammar/line":268,"Geometry_grammar/Symmetric_line_point#Geometry_grammar/line#Geometry_grammar/line#Geometry_grammar/pt":269,"Geometry_grammar/Symmetric_point_axis#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/line":270,"Geometry_grammar/Symmetric_point_point#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt":271,"Geometry_grammar/Symmetric_quad_axis#Geometry_grammar/quad#Geometry_grammar/quad#Geometry_grammar/line":272,"Geometry_grammar/Symmetric_quad_point#Geometry_grammar/quad#Geometry_grammar/quad#Geometry_grammar/pt":273,"Geometry_grammar/Symmetric_seg_axis#Geometry_grammar/segment#Geometry_grammar/segment#Geometry_grammar/line":274,"Geometry_grammar/Symmetric_seg_point#Geometry_grammar/segment#Geometry_grammar/segment#Geometry_grammar/pt":275,"Geometry_grammar/Symmetric_tri_axis#Geometry_grammar/triangle#Geometry_grammar/triangle#Geometry_grammar/line":276,"Geometry_grammar/Symmetric_tri_point#Geometry_grammar/triangle#Geometry_grammar/triangle#Geometry_grammar/pt":277,"Geometry_grammar/Tan#Geometry_grammar/number#Geometry_grammar/number":278,"Geometry_grammar/Tangent#Geometry_grammar/line#Geometry_grammar/circle#Geometry_grammar/pt":279,"Geometry_grammar/The_parallel#Geometry_grammar/line#Geometry_grammar/line#Geometry_grammar/pt":280,"Geometry_grammar/The_perpendicular#Geometry_grammar/line#Geometry_grammar/line#Geometry_grammar/pt":281,"Geometry_grammar/Three#Geometry_grammar/number":282,"Geometry_grammar/Trapezium#Geometry_grammar/pred#Geometry_grammar/quad":283,"Geometry_grammar/Tri_acute#Geometry_grammar/pred#Geometry_grammar/triangle":284,"Geometry_grammar/Tri_equilateral#Geometry_grammar/pred#Geometry_grammar/triangle":285,"Geometry_grammar/Tri_isoceles#Geometry_grammar/pred#Geometry_grammar/triangle":286,"Geometry_grammar/Tri_isoceles_in#Geometry_grammar/pred#Geometry_grammar/triangle#Geometry_grammar/pt":287,"Geometry_grammar/Tri_isometric#Geometry_grammar/pred#Geometry_grammar/triangle#Geometry_grammar/triangle":288,"Geometry_grammar/Tri_obtuse#Geometry_grammar/pred#Geometry_grammar/triangle":289,"Geometry_grammar/Tri_rectangle#Geometry_grammar/pred#Geometry_grammar/triangle":290,"Geometry_grammar/Tri_rectangle_in#Geometry_grammar/pred#Geometry_grammar/triangle#Geometry_grammar/pt":291,"Geometry_grammar/Tri_similar#Geometry_grammar/pred#Geometry_grammar/triangle#Geometry_grammar/triangle":292,"Geometry_grammar/Triangle#Geometry_grammar/triangle#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt":293,"Geometry_grammar/Triangle_angle#Geometry_grammar/angle#Geometry_grammar/triangle#Geometry_grammar/pt":294,"Geometry_grammar/Triangle_lines#Geometry_grammar/triangle#Geometry_grammar/line#Geometry_grammar/line#Geometry_grammar/line":295,"Geometry_grammar/Triangle_string_000#entity(Geometry_grammar/kstring)":296,"Geometry_grammar/Triangle_string_001#entity(Geometry_grammar/kstring)":297,"Geometry_grammar/Two#Geometry_grammar/number":298,"Geometry_grammar/Zero#Geometry_grammar/number":299,"List#list(Geometry_grammar/constr)#Geometry_grammar/constr#Geometry_grammar/constr":300,"List#list(Geometry_grammar/constr)#Geometry_grammar/constr#Geometry_grammar/constr#Geometry_grammar/constr":301,"List#list(Geometry_grammar/constr)#Geometry_grammar/constr#Geometry_grammar/constr#Geometry_grammar/constr#Geometry_grammar/constr":302,"List#list(Geometry_grammar/line)#Geometry_grammar/line#Geometry_grammar/line":303,"List#list(Geometry_grammar/line)#Geometry_grammar/line#Geometry_grammar/line#Geometry_grammar/line":304,"List#list(Geometry_grammar/line)#Geometry_grammar/line#Geometry_grammar/line#Geometry_grammar/line#Geometry_grammar/line":305,"List#list(Geometry_grammar/named_object)#Geometry_grammar/named_object":306,"List#list(Geometry_grammar/named_object)#Geometry_grammar/named_object#Geometry_grammar/named_object":307,"List#list(Geometry_grammar/named_object)#Geometry_grammar/named_object#Geometry_grammar/named_object#Geometry_grammar/named_object":308,"List#list(Geometry_grammar/named_object)#Geometry_grammar/named_object#Geometry_grammar/named_object#Geometry_grammar/named_object#Geometry_grammar/named_object":309,"List#list(Geometry_grammar/named_object)#Geometry_grammar/named_object#Geometry_grammar/named_object#Geometry_grammar/named_object#Geometry_grammar/named_object#Geometry_grammar/named_object":310,"List#list(Geometry_grammar/named_object)#Geometry_grammar/named_object#Geometry_grammar/named_object#Geometry_grammar/named_object#Geometry_grammar/named_object#Geometry_grammar/named_object#Geometry_grammar/named_object":311,"List#list(Geometry_grammar/named_object)#Geometry_grammar/named_object#Geometry_grammar/named_object#Geometry_grammar/named_object#Geometry_grammar/named_object#Geometry_grammar/named_object#Geometry_grammar/named_object#Geometry_grammar/named_object":312,"List#list(Geometry_grammar/named_object)#Geometry_grammar/named_object#Geometry_grammar/named_object#Geometry_grammar/named_object#Geometry_grammar/named_object#Geometry_grammar/named_object#Geometry_grammar/named_object#Geometry_grammar/named_object#Geometry_grammar/named_object":313,"List#list(Geometry_grammar/number)#Geometry_grammar/number#Geometry_grammar/number":314,"List#list(Geometry_grammar/number)#Geometry_grammar/number#Geometry_grammar/number#Geometry_grammar/number":315,"List#list(Geometry_grammar/number)#Geometry_grammar/number#Geometry_grammar/number#Geometry_grammar/number#Geometry_grammar/number":316,"List#list(Geometry_grammar/number)#Geometry_grammar/number#Geometry_grammar/number#Geometry_grammar/number#Geometry_grammar/number#Geometry_grammar/number":317,"List#list(Geometry_grammar/plane)#Geometry_grammar/plane#Geometry_grammar/plane":318,"List#list(Geometry_grammar/plane)#Geometry_grammar/plane#Geometry_grammar/plane#Geometry_grammar/plane":319,"List#list(Geometry_grammar/pred)#Geometry_grammar/pred":320,"List#list(Geometry_grammar/pred)#Geometry_grammar/pred#Geometry_grammar/pred":321,"List#list(Geometry_grammar/pred)#Geometry_grammar/pred#Geometry_grammar/pred#Geometry_grammar/pred":322,"List#list(Geometry_grammar/pred)#Geometry_grammar/pred#Geometry_grammar/pred#Geometry_grammar/pred#Geometry_grammar/pred":323,"List#list(Geometry_grammar/pred)#Geometry_grammar/pred#Geometry_grammar/pred#Geometry_grammar/pred#Geometry_grammar/pred#Geometry_grammar/pred":324,"List#list(Geometry_grammar/pred)#Geometry_grammar/pred#Geometry_grammar/pred#Geometry_grammar/pred#Geometry_grammar/pred#Geometry_grammar/pred#Geometry_grammar/pred":325,"List#list(Geometry_grammar/pred)#Geometry_grammar/pred#Geometry_grammar/pred#Geometry_grammar/pred#Geometry_grammar/pred#Geometry_grammar/pred#Geometry_grammar/pred#Geometry_grammar/pred":326,"List#list(Geometry_grammar/pred)#Geometry_grammar/pred#Geometry_grammar/pred#Geometry_grammar/pred#Geometry_grammar/pred#Geometry_grammar/pred#Geometry_grammar/pred#Geometry_grammar/pred#Geometry_grammar/pred":327,"List#list(Geometry_grammar/pt)#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt":328,"List#list(Geometry_grammar/pt)#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt#Geometry_grammar/pt":329,"List#list(list(Geometry_grammar/pred))#list(Geometry_grammar/pred)":330,"Nil#list(Geometry_grammar/named_object)":331},"unk_token":"[UNK]"}}